In [97]:
import sqlite3
import pandas as pd
import numpy as np
import json
import csv

In [31]:
connection = sqlite3.connect("./subscriber-pipeline-starter-kit/dev/cademycode.db")
cursor = connection.cursor()

# Names of table in the database cademycode.db

In [32]:
tables = cursor.execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()
print(tables)

[('cademycode_students',), ('cademycode_courses',), ('cademycode_student_jobs',)]

In [33]:
tables_columns = cursor.execute("""PRAGMA table_info('cademycode_students');""").fetchall()
print([column[1] for column in tables_columns])

['uuid', 'name', 'dob', 'sex', 'contact_info', 'job_id', 'num_course_taken', 'current_career_path_id', 'time_spent_hrs']

# Import tables as cursor object

## Courses table

In [34]:
courses = cursor.execute("""SELECT * FROM cademycode_courses""").fetchall()

In [35]:
print(courses)

[(1, 'data scientist', 20), (2, 'data engineer', 20), (3, 'data analyst', 12), (4, 'software engineering', 25), (5, 'backend engineer', 18), (6, 'frontend engineer', 20), (7, 'iOS developer', 27), (8, 'android developer', 27), (9, 'machine learning engineer', 35), (10, 'ux/ui designer', 15)]

In [36]:
student_jobs = cursor.execute("""SELECT * FROM cademycode_student_jobs""").fetchmany(10)

## Student jobs table

In [37]:
print(student_jobs)

[(1, 'analytics', 86000), (2, 'engineer', 101000), (3, 'software developer', 110000), (4, 'creative', 66000), (5, 'financial services', 135000), (6, 'education', 61000), (7, 'HR', 80000), (8, 'student', 10000), (9, 'healthcare', 120000), (0, 'other', 80000)]

## Students table

In [38]:
students = cursor.execute("""SELECT * FROM cademycode_students""").fetchmany(10)

In [39]:
print(students)

[(1, 'Annabelle Avery', '1943-07-03', 'F', '{"mailing_address": "303 N Timber Key, Irondale, Wisconsin, 84736", "email": "annabelle_avery9376@woohoo.com"}', '7.0', '6.0', '1.0', '4.99'), (2, 'Micah Rubio', '1991-02-07', 'M', '{"mailing_address": "767 Crescent Fair, Shoals, Indiana, 37439", "email": "rubio6772@hmail.com"}', '7.0', '5.0', '8.0', '4.4'), (3, 'Hosea Dale', '1989-12-07', 'M', '{"mailing_address": "P.O. Box 41269, St. Bonaventure, Virginia, 83637", "email": "hosea_dale8084@coldmail.com"}', '7.0', '8.0', '8.0', '6.74'), (4, 'Mariann Kirk', '1988-07-31', 'F', '{"mailing_address": "517 SE Wintergreen Isle, Lane, Arkansas, 82242", "email": "kirk4005@hmail.com"}', '6.0', '7.0', '9.0', '12.31'), (5, 'Lucio Alexander', '1963-08-31', 'M', '{"mailing_address": "18 Cinder Cliff, Doyles borough, Rhode Island, 73737", "email": "alexander9810@hmail.com"}', '7.0', '14.0', '3.0', '5.64'), (6, 'Shavonda Mcmahon', '1989-10-15', 'F', '{"mailing_address": "P.O. Box 81591, Tarpon Springs, Montana, 37057", "email": "shavonda5863@coldmail.com"}', '6.0', '10.0', '3.0', '10.12'), (7, 'Terrell Bleijenberg', '1959-05-05', 'M', '{"mailing_address": "P.O. Box 53471, Oskaloosa, Virginia, 85274", "email": "bleijenberg188@hmail.com"}', '2.0', '9.0', '8.0', '24.17'), (8, 'Stanford Allan', '1997-11-22', 'M', '{"mailing_address": "255 Spring Avenue, Point Baker, Texas, 15796", "email": "stanford_allan8055@coldmail.com"}', '3.0', '3.0', '1.0', '19.54'), (9, 'Tricia Delacruz', '1961-10-20', 'F', '{"mailing_address": "997 Dewy Apple, Lake Lindsey, Washington, 78266", "email": "tricia_delacruz6622@woohoo.com"}', '1.0', '6.0', '9.0', '1.75'), (10, 'Regenia van der Helm', '1999-02-23', 'N', '{"mailing_address": "220 Middle Ridge, Falcon Heights, New Mexico, 46971", "email": "regenia6908@inlook.com"}', '5.0', '7.0', '6.0', '13.55')]

# Import tables as Pandas Dataframes

## Dataframe - Students

In [40]:
students_df = pd.read_sql_query("SELECT * FROM cademycode_students", con = connection)

In [41]:
students_df.head()

,uuid,name,dob,sex,contact_info,job_id,num_course_taken,current_career_path_id,time_spent_hrs
0,1,Annabelle Avery,1943-07-03,F,"{""mailing_address"": ""303 N Timber Key, Irondal...",7.0,6.0,1.0,4.99
1,2,Micah Rubio,1991-02-07,M,"{""mailing_address"": ""767 Crescent Fair, Shoals...",7.0,5.0,8.0,4.4
2,3,Hosea Dale,1989-12-07,M,"{""mailing_address"": ""P.O. Box 41269, St. Bonav...",7.0,8.0,8.0,6.74
3,4,Mariann Kirk,1988-07-31,F,"{""mailing_address"": ""517 SE Wintergreen Isle, ...",6.0,7.0,9.0,12.31
4,5,Lucio Alexander,1963-08-31,M,"{""mailing_address"": ""18 Cinder Cliff, Doyles b...",7.0,14.0,3.0,5.64

**Info about Dataframe - Students**

In [42]:
students_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    5000 non-null   int64
 1   name                    5000 non-null   object
 2   dob                     5000 non-null   object
 3   sex                     5000 non-null   object
 4   contact_info            5000 non-null   object
 5   job_id                  4995 non-null   object
 6   num_course_taken        4749 non-null   object
 7   current_career_path_id  4529 non-null   object
 8   time_spent_hrs          4529 non-null   object
dtypes: int64(1), object(8)
memory usage: 351.7+ KB

**Shape of Dataframe-Students**

In [43]:
students_df.shape

(5000, 9)

**Column names of Dataframe - Students**

In [44]:
students_df.columns

Index(['uuid', 'name', 'dob', 'sex', 'contact_info', 'job_id',
       'num_course_taken', 'current_career_path_id', 'time_spent_hrs'],
      dtype='object')

**NAN Values in Dataframes - Students**

**Data types in Dataframe - Students**

In [45]:
students_df.dtypes

uuid                       int64
name                      object
dob                       object
sex                       object
contact_info              object
job_id                    object
num_course_taken          object
current_career_path_id    object
time_spent_hrs            object
dtype: object

**Duplicated student names**

In [46]:
students_df[students_df.name.duplicated(keep=False)]

,uuid,name,dob,sex,contact_info,job_id,num_course_taken,current_career_path_id,time_spent_hrs
534,535,Robbie Davies,1965-06-11,F,"{""mailing_address"": ""666 Dusty Land, Pangburn,...",5.0,15.0,3.0,0.53
1118,1119,Melvin Felt,1955-07-30,N,"{""mailing_address"": ""804 Rustic Elm, Geneseo v...",3.0,6.0,10.0,2.77
2116,2117,Robbie Davies,1942-10-17,M,"{""mailing_address"": ""111 Squaw Alley, Buckeye,...",7.0,0.0,None,None
3583,3584,Melvin Felt,1987-08-25,N,"{""mailing_address"": ""54 Noble Loaf Run, Lakela...",3.0,11.0,1.0,0.47

**All rows with NAN values**

In [47]:
students_df[students_df.isna().any(axis = 1)]

,uuid,name,dob,sex,contact_info,job_id,num_course_taken,current_career_path_id,time_spent_hrs
15,16,Norene Dalton,1976-04-30,F,"{""mailing_address"": ""130 Wishing Essex, Branch...",6.0,0.0,None,None
19,20,Sofia van Steenbergen,1990-02-21,N,"{""mailing_address"": ""634 Clear Barn Dell, Beam...",7.0,13.0,None,None
25,26,Doug Browning,1970-06-08,M,"{""mailing_address"": ""P.O. Box 15845, Devine, F...",7.0,None,5.0,1.92
26,27,Damon Schrauwen,1953-10-31,M,"{""mailing_address"": ""P.O. Box 84659, Maben, Ge...",4.0,None,10.0,3.73
30,31,Christoper Warner,1989-12-28,M,"{""mailing_address"": ""556 Stony Highlands, Drai...",2.0,5.0,None,None
...,...,...,...,...,...,...,...,...,...
4948,4949,Dewitt van Malsem,1949-03-08,M,"{""mailing_address"": ""423 Course Trail, Wilmot,...",4.0,7.0,None,None
4956,4957,Todd Stamhuis,1961-06-15,M,"{""mailing_address"": ""251 Grand Rose Underpass,...",7.0,8.0,None,None
4974,4975,Jorge Creelman,1944-11-24,M,"{""mailing_address"": ""919 Well Overpass, Linden...",2.0,15.0,None,None
4980,4981,Brice Franklin,1946-12-01,M,"{""mailing_address"": ""947 Panda Way, New Bedfor...",4.0,None,5.0,8.66
4985,4986,Russel Vonck,1994-09-07,M,"{""mailing_address"": ""815 Middle Timber Corner,...",5.0,None,5.0,16.44

**Number of NAN value in column career for each job ID**

In [48]:
pd.crosstab(
    students_df['job_id'],
    students_df['current_career_path_id'].isna(),
    rownames = ['job_ID'],
    colnames = ['career_path_is_nan'])

career_path_is_nan  False  True
job_ID
1.0                   641     52
2.0                   645     61
3.0                   618     57
4.0                   612     59
5.0                   590     70
6.0                   572     85
7.0                   618     62
8.0                   228     25

**Number of unique values for each columns**

In [49]:
students_df.nunique()

uuid                      5000
name                      4998
dob                       4492
sex                          3
contact_info              5000
job_id                       8
num_course_taken            16
current_career_path_id      10
time_spent_hrs            2192
dtype: int64

## Dataframe - Courses

In [50]:
courses_df = pd.read_sql_query("SELECT * FROM cademycode_courses", con = connection)

In [51]:
courses_df

   career_path_id           career_path_name  hours_to_complete
0               1             data scientist                 20
1               2              data engineer                 20
2               3               data analyst                 12
3               4       software engineering                 25
4               5           backend engineer                 18
5               6          frontend engineer                 20
6               7              iOS developer                 27
7               8          android developer                 27
8               9  machine learning engineer                 35
9              10             ux/ui designer                 15

**Info about Dataframe - Courses**

In [52]:
courses_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   career_path_id     10 non-null     int64
 1   career_path_name   10 non-null     object
 2   hours_to_complete  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

**Shape of Dataframe - Courses**

In [53]:
courses_df.shape

(10, 3)

**NAN values in Dataframe - Courses**

In [54]:
courses_df.isna().sum()

career_path_id       0
career_path_name     0
hours_to_complete    0
dtype: int64

**Data types in Dataframe - Courses**

In [55]:
courses_df.dtypes

career_path_id        int64
career_path_name     object
hours_to_complete     int64
dtype: object

## Dataframe - Student jobs

In [56]:
student_jobs_df = pd.read_sql_query("SELECT * FROM cademycode_student_jobs", con = connection)

In [57]:
student_jobs_df

    job_id        job_category  avg_salary
0        1           analytics       86000
1        2            engineer      101000
2        3  software developer      110000
3        4            creative       66000
4        5  financial services      135000
5        6           education       61000
6        7                  HR       80000
7        8             student       10000
8        9          healthcare      120000
9        0               other       80000
10       3  software developer      110000
11       4            creative       66000
12       5  financial services      135000

**Info about Dataframe - Student jobs**

In [58]:
student_jobs_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   job_id        13 non-null     int64
 1   job_category  13 non-null     object
 2   avg_salary    13 non-null     int64
dtypes: int64(2), object(1)
memory usage: 440.0+ bytes

**Shape of Dataframe - Student jobs**

In [59]:
student_jobs_df.shape

(13, 3)

**NAN values in Dataframe - Student jobs**

In [60]:
student_jobs_df.isna().sum()

job_id          0
job_category    0
avg_salary      0
dtype: int64

**Data types Dataframe - Student jobs**

In [61]:
student_jobs_df.dtypes

job_id           int64
job_category    object
avg_salary       int64
dtype: object

# Summary of data inspection

1. student jobs dataframe has duplicities
2. There are 2 duplicated names in dataframe Students
3. highest number of NAN values in column "current_career_path_id" has job_id equal to "Education" and "HR".
4. Five rows has job_id as 'None'
5. Career Path as 'None' may indicate that the individual student has not decided about his career yet --> new career category can be defined named as 'unknown'. 
6. NAN in time_spent_hrs can be replaced by median value
7. There are 707 rows with NAN value in these columns: job_id, num_course_taken, current_career_path_id, time_spent_hrs

# Data cleaning

## Dataframe Student jobs

**Duplicate rows can be dropped**

In [62]:
student_jobs_df_new = student_jobs_df.drop_duplicates()

In [63]:
student_jobs_df_new

   job_id        job_category  avg_salary
0       1           analytics       86000
1       2            engineer      101000
2       3  software developer      110000
3       4            creative       66000
4       5  financial services      135000
5       6           education       61000
6       7                  HR       80000
7       8             student       10000
8       9          healthcare      120000
9       0               other       80000

## Dataframe - Courses

In [64]:
new_row_course = {'career_path_id' : [0], 'career_path_name' : ['unknown'], 'hours_to_complete' : [0]}
new_row_course_df = pd.DataFrame(data = new_row_course)

In [65]:
courses_df_new = pd.concat([new_row_course_df, courses_df], axis = 0).reset_index().drop(labels = ('index'), axis =1)

In [66]:
courses_df_new

    career_path_id           career_path_name  hours_to_complete
0                0                    unknown                  0
1                1             data scientist                 20
2                2              data engineer                 20
3                3               data analyst                 12
4                4       software engineering                 25
5                5           backend engineer                 18
6                6          frontend engineer                 20
7                7              iOS developer                 27
8                8          android developer                 27
9                9  machine learning engineer                 35
10              10             ux/ui designer                 15

## Dataframe Students

In [67]:
students_df_new = students_df.copy(deep = True)

In [68]:
students_df_new

,uuid,name,dob,sex,contact_info,job_id,num_course_taken,current_career_path_id,time_spent_hrs
0,1,Annabelle Avery,1943-07-03,F,"{""mailing_address"": ""303 N Timber Key, Irondal...",7.0,6.0,1.0,4.99
1,2,Micah Rubio,1991-02-07,M,"{""mailing_address"": ""767 Crescent Fair, Shoals...",7.0,5.0,8.0,4.4
2,3,Hosea Dale,1989-12-07,M,"{""mailing_address"": ""P.O. Box 41269, St. Bonav...",7.0,8.0,8.0,6.74
3,4,Mariann Kirk,1988-07-31,F,"{""mailing_address"": ""517 SE Wintergreen Isle, ...",6.0,7.0,9.0,12.31
4,5,Lucio Alexander,1963-08-31,M,"{""mailing_address"": ""18 Cinder Cliff, Doyles b...",7.0,14.0,3.0,5.64
...,...,...,...,...,...,...,...,...,...
4995,4996,Quentin van Harn,1967-07-07,N,"{""mailing_address"": ""591 Blue Berry, Coulee, I...",5.0,5.0,2.0,13.82
4996,4997,Alejandro van der Sluijs,1964-11-03,M,"{""mailing_address"": ""30 Iron Divide, Pewaukee ...",4.0,13.0,1.0,7.86
4997,4998,Brock Mckenzie,2004-11-25,M,"{""mailing_address"": ""684 Rustic Rest Avenue, C...",8.0,10.0,3.0,12.1
4998,4999,Donnetta Dillard,1943-02-12,N,"{""mailing_address"": ""900 Indian Oval, Euclid, ...",3.0,6.0,5.0,14.86
4999,5000,Elton Otway,1994-12-23,M,"{""mailing_address"": ""406 Zephyr Port, Oskaloos...",2.0,5.0,3.0,10.04

**Job id NAN values are filled by 0 - those lines are supposed to be joined with category named as 'other'**

In [69]:
students_df_new['job_id'].fillna(0, inplace = True)

**Time spent hours NAN values are replaced by median value calculated from remaining column values**

In [70]:
median_time_spent = round(students_df_new['time_spent_hrs'].median(),0)

In [71]:
students_df_new['time_spent_hrs'].fillna(median_time_spent, inplace = True)

**Career path id NAN values are replace by 0 . Those lines are supposed to be joined with career path id = 0 (unknown).**

In [72]:
students_df_new['current_career_path_id'].fillna(0, inplace = True)

In [73]:
students_df_new.isna().sum()

uuid                        0
name                        0
dob                         0
sex                         0
contact_info                0
job_id                      0
num_course_taken          251
current_career_path_id      0
time_spent_hrs              0
dtype: int64

**Num_course_taken NAN values are replaced by median value**

In [74]:
median_num_course_taken = round(students_df_new['num_course_taken'].median(),0)

In [75]:
students_df_new['num_course_taken'].fillna(median_num_course_taken, inplace = True)

In [76]:
students_df_new.isna().sum()

uuid                      0
name                      0
dob                       0
sex                       0
contact_info              0
job_id                    0
num_course_taken          0
current_career_path_id    0
time_spent_hrs            0
dtype: int64

**Manipulating with the column 'contact_info'**

In [77]:
students_df_new['contact_info'] = students_df_new.contact_info.apply(lambda x: json.loads(x))

In [78]:
students_df_new['address'] = students_df_new.contact_info.map(lambda q: q['mailing_address'])

In [79]:
students_df_new['email'] = students_df_new.contact_info.map(lambda q: q['email'])

In [80]:
type(students_df_new.contact_info[0])

dict

In [81]:
students_df_new['state'] = students_df_new.address.map(lambda q: q.split(',')[2])

**Convert string objects to numerical values**

In [82]:
students_df_new.job_id = pd.to_numeric(students_df_new.job_id)

In [83]:
students_df_new.num_course_taken = pd.to_numeric(students_df_new.num_course_taken)

In [84]:
students_df_new.current_career_path_id = pd.to_numeric(students_df_new.current_career_path_id)

In [85]:
students_df_new.time_spent_hrs = pd.to_numeric(students_df_new.time_spent_hrs)

**Convert job_id, num_course_taken, current_career_path_id, to integer values**

In [86]:
students_df_new.job_id = students_df_new.job_id.astype(int)

In [87]:
students_df_new.num_course_taken = students_df_new.num_course_taken.astype(int)

In [88]:
students_df_new.current_career_path_id = students_df_new.current_career_path_id.astype(int)

**Drop contact info column**

In [89]:
students_df_new.drop(labels = 'contact_info', axis =1, inplace = True)

**Rename column 'dob' to 'date_of_birth'**

In [90]:
students_df_new.rename(mapper = {'dob': 'date_of_birth', 'current_career_path_id' : 'career_path_id'}, axis = 1, inplace = True)

In [91]:
students_df_new.head()

,uuid,name,date_of_birth,sex,job_id,num_course_taken,career_path_id,time_spent_hrs,address,email,state
0,1,Annabelle Avery,1943-07-03,F,7,6,1,4.99,"303 N Timber Key, Irondale, Wisconsin, 84736",annabelle_avery9376@woohoo.com,Wisconsin
1,2,Micah Rubio,1991-02-07,M,7,5,8,4.40,"767 Crescent Fair, Shoals, Indiana, 37439",rubio6772@hmail.com,Indiana
2,3,Hosea Dale,1989-12-07,M,7,8,8,6.74,"P.O. Box 41269, St. Bonaventure, Virginia, 83637",hosea_dale8084@coldmail.com,Virginia
3,4,Mariann Kirk,1988-07-31,F,6,7,9,12.31,"517 SE Wintergreen Isle, Lane, Arkansas, 82242",kirk4005@hmail.com,Arkansas
4,5,Lucio Alexander,1963-08-31,M,7,14,3,5.64,"18 Cinder Cliff, Doyles borough, Rhode Island,...",alexander9810@hmail.com,Rhode Island

In [92]:
students_df_new.dtypes

uuid                  int64
name                 object
date_of_birth        object
sex                  object
job_id                int32
num_course_taken      int32
career_path_id        int32
time_spent_hrs      float64
address              object
email                object
state                object
dtype: object

In [93]:
students_df_new.head()

,uuid,name,date_of_birth,sex,job_id,num_course_taken,career_path_id,time_spent_hrs,address,email,state
0,1,Annabelle Avery,1943-07-03,F,7,6,1,4.99,"303 N Timber Key, Irondale, Wisconsin, 84736",annabelle_avery9376@woohoo.com,Wisconsin
1,2,Micah Rubio,1991-02-07,M,7,5,8,4.40,"767 Crescent Fair, Shoals, Indiana, 37439",rubio6772@hmail.com,Indiana
2,3,Hosea Dale,1989-12-07,M,7,8,8,6.74,"P.O. Box 41269, St. Bonaventure, Virginia, 83637",hosea_dale8084@coldmail.com,Virginia
3,4,Mariann Kirk,1988-07-31,F,6,7,9,12.31,"517 SE Wintergreen Isle, Lane, Arkansas, 82242",kirk4005@hmail.com,Arkansas
4,5,Lucio Alexander,1963-08-31,M,7,14,3,5.64,"18 Cinder Cliff, Doyles borough, Rhode Island,...",alexander9810@hmail.com,Rhode Island

# Upload of cleaned dataframes into new sqlite database

In [94]:
connection_new = sqlite3.connect("./subscriber-pipeline-starter-kit/dev/cademycode_clean_jup_ntb.db")
cursor_new = connection_new.cursor()

In [95]:
cursor_new.execute('''CREATE TABLE cademycode_students_new (
                        uuid INTEGER, 
                        name VARCHAR, 
                        date_of_birth VARCHAR, 
                        sex TEXT, 
                        job_id INTEGER, 
                        num_course_taken INTEGER, 
                        career_path_id INTEGER,
                        time_spent_hours VARCHAR, 
                        address VARCHAR,
                        email VARCHAR, 
                        state VARCHAR)''')

OperationalError: table cademycode_students_new already exists

In [ ]:
cursor_new.execute('''CREATE TABLE cademycode_courses_new (
                      career_path_id INTEGER, 
                      career_path_name VARCHAR,
                      hours_to_complete INTEGER)
                    ''')

In [ ]:
cursor_new.execute('''CREATE TABLE cademycode_student_jobs_new (
                      job_id INTEGER,
                      job_category VARCHAR,
                      avg_salary VARCHAR)
                    ''')

In [ ]:
students_df_new.to_sql('cademycode_students_new', connection_new, if_exists='replace',index=False)

In [ ]:
courses_df_new.to_sql('cademycode_courses_new', connection_new, if_exists='replace',index=False)

In [ ]:
student_jobs_df_new.to_sql('cademycode_student_jobs_new', connection_new, if_exists='replace',index=False)

In [ ]:
tables_new = cursor_new.execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()
print(tables_new)

In [ ]:
connection_new.commit()
connection_new.close()

# Generating a clean CSV file from database

In [ ]:
conn = sqlite3.connect("./subscriber-pipeline-starter-kit/dev/cademycode_clean_jup_ntb.db")
df_students = pd.read_sql_query("SELECT * FROM cademycode_students_new", con = conn)
df_jobs = pd.read_sql_query("SELECT * FROM cademycode_student_jobs_new", con = conn)
df_courses = pd.read_sql_query("SELECT * FROM cademycode_courses_new", con = conn)

In [ ]:
df_combined = df_students.merge(df_jobs, how = 'left', on = 'job_id')

In [ ]:
df_combined = df_combined.merge(df_courses, how = 'left', on='career_path_id')

In [ ]:
df_combined.drop(labels = ['job_id', 'career_path_id'], axis = 1, inplace = True)
df_combined.to_csv("./subscriber-pipeline-starter-kit/dev/combined_file.csv")

In [161]:
from functools import reduce
from collections import namedtuple
import numpy as np
import datetime

In [160]:
with open("./subscriber-pipeline-starter-kit/dev/combined_file.csv", newline = '') as csvfile:
    reader = csv.reader(csvfile, delimiter = ',')
    csv_tuple = namedtuple("csv_tuple", next(reader)[1:])
    mapper = map(lambda line: csv_tuple(int(line[1]), str(line[2]), datetime.str(line[3]), line[4], line[5], line[6], 
                                        line[7], line[8], line[9], line[10], line[11], line[12], 
                                        line[13]), reader)
    nan = filter(lambda line: line.uuid == 10, mapper)
    print(tuple(nan))

NameError: name 'date' is not defined